tests/fixtures/AVogel BEA028.txt

SALES I N VOICE
A.Vogel Ltd
2 Brewster Place, Irvine, KA11 5DD
Beanfreaks Ltd
95 Albany Road Order Line: 0800 085 0820
Help Line: 0845 608 5858
Cardiff Main Line: 01294 277344
CF24 3LP Fax: 01294 277922
Email: orders@avogel.co.uk
UK
Page 1 of 1
LM
Account No:BEA028 Invoice No: 01633256 Date: 23/09/2025 Order Ref: AV02287702
Description Qty Code RRP TP Disc VAT Rate Cost
Atrogel - 100ml 4 20200 13.99 7.81 10.00% 20% 28.12
Atrogel - 50ml 1 20250 8.99 5.02 10.00% 20% 4.52
Centaurium umb. - 50ml 2 30311 12.99 7.25 10.00% 20% 13.05
Dormeasan - 50ml 2 40510 12.99 7.25 10.00% 20% 13.05
Echinacea Lozenges - 40g 4 80706 2.49 1.40 10.00% 20% 5.04
Echinaforce Drops - 100ml 1 30317 21.99 12.64 10.00% 20% 11.38
Echinaforce Drops - 50ml 2 30316 12.99 7.25 10.00% 20% 13.05
Echinaforce Tablets - 120tabs 1 30355 12.99 7.25 10.00% 20% 6.53
Herbamare *Org* - 250g 2 10037 4.99 3.64 10.00% Zero Rated 6.55
Menoforce Tablets - 30tabs 1 30445 15.99 9.13 10.00% 20% 8.22
Menopause Support - 60 caps 1 10060 16.99 9.56 10.00% 20% 8.60
Milk Thistle - 50ml 2 40406 12.99 7.25 10.00% 20% 13.05
Nature C Tabs - 36tabs 1 80704 9.99 5.62 10.00% 20% 5.06
Neem Soothing Cream - 50g 2 50003 8.99 4.87 10.00% 20% 8.77
Silicol Skin - 50ml 1 56603 9.79 5.80 10.00% 20% 5.22
Sinuforce Nasal Spray - 20 ml 1 40520 8.99 5.02 10.00% 20% 4.52
Solidago Complex - 50ml 1 40418 12.99 7.25 10.00% 20% 6.53
Venagel - 100g 1 20109 13.99 7.81 10.00% 20% 7.03
1 x 40308 - Cystorelief Cystitis OralDrop 50ml - 50ml
3 x 40516 - Bronchoforce - 50ml
We are sorry these products are currently out of stock – please reorder.
VAT NET
Zero Rated 6.55
20% 161.74
Sub Total: 168.29
VAT: 32.30
Currency: GBP Customer PO: 0016955 Total: 200.59
Account Name: A.Vogel Ltd Conditions of Sale:
Bank: RBS 1. Payment to be made within30days of invoice
Sort Code: 83-27-26 2. Ownership of goods delivered remains with A.Vogel Ltd until all sums
Account: 00111289 owed to A.Vogel Ltd, on whatever grounds, have been paid
3. Claims must be made within 7 days of receipt of the goods
VAT No. 454 9330 37 4. This agreement shall be governed by Scots Law
Beanfreaks Ltd
95 Albany Road
CF24 3LP