tests/fixtures/AVogel BEA031.txt

SALES I N VOICE
A.Vogel Ltd
2 Brewster Place, Irvine, KA11 5DD
Beanfreaks Ltd
124 Cowbridge Road East Order Line: 0800 085 0820
Help Line: 0845 608 5858
Canton Main Line: 01294 277344
Cardiff Fax: 01294 277922
Email: orders@avogel.co.uk
CF11 9DX
Page 1 of 1
UK
LM
Account No:BEA031 Invoice No: 01653176 Date: 18/03/2026Trolley: Trolley Eight Order Ref: AV02321066
Description Qty Code RRP TP Disc VAT Rate Cost
Atrogel - 100ml 2 20200 13.99 7.81 10.00% 20% 14.06
Biosnacky Alfalfa *Org* - 40g 2 11001 2.25 1.51 10.00% Zero Rated 2.72
Biosnacky Brocolli Mix *Org* - 1 11031 2.25 1.51 10.00% Zero Rated 1.36
Dandelion - 50ml 2 30347 12.99 7.25 10.00% 20% 13.05
Eye Drops Moisturising - 10ml 1 30457 11.99 6.69 10.00% 20% 6.02
Hyperiforce - 60tabs 1 30434 13.99 7.81 10.00% 20% 7.03
Milk Thistle - 100ml 6 40407 21.99 12.64 10.00% 20% 68.26
Milk Thistle Comp Tabs 60tabs 3 40405 12.99 7.25 10.00% 20% 19.58
Silicol Gel - 200ml 2 56601 9.95 5.40 10.00% 20% 9.72
Venaforce - 60 tabs 1 30410 24.99 14.58 10.00% 20% 13.12
Santasapina Bon Bons - 100g 2 80723 3.49 1.95 10.00% 20% 3.51
We are sorry these products are currently out of stock – please reorder.
2 x 30454 - Premenstrual Relief 50ml - 50ml
1 x 80706 - Echinacea Lozenges - 40g
1 x 40512 - Stress Relief Daytime - 50ml
VAT NET
20% 154.35
Zero Rated 4.08
Sub Total: 158.43
VAT: 30.86
Currency: GBP Customer PO: 0026080 Total: 189.29
Account Name: A.Vogel Ltd Conditions of Sale:
Bank: RBS 1. Payment to be made within30days of invoice
Sort Code: 83-27-26 2. Ownership of goods delivered remains with A.Vogel Ltd until all sums
Account: 00111289 owed to A.Vogel Ltd, on whatever grounds, have been paid
3. Claims must be made within 7 days of receipt of the goods
VAT No. 454 9330 37 4. This agreement shall be governed by Scots Law
Beanfreaks Ltd
124 Cowbridge Road East
CF11 9DX
